import Mathlib

-- Solution set: all pairs (a,b) of positive integers satisfying the equation
abbrev putnam_2018_a1_solution : Set (ℤ × ℤ) := 
  {(a, b) | 0 < a ∧ 0 < b ∧ (1 : ℚ) / ↑a + (1 : ℚ) / ↑b = (3 : ℚ) / 2018}

lemma valid_factors_of_2018_sq : 
  ∀ d : ℤ, d ∣ (2018 : ℤ) ^ 2 → 0 < d → d % 3 = 1 → 
    d ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) := by sorry

lemma factors_are_valid : 
  (1 : ℤ) ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) ∧
  (4 : ℤ) ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) ∧
  (1009 : ℤ) ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) ∧
  (4036 : ℤ) ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) ∧
  (1018081 : ℤ) ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) ∧
  (4072324 : ℤ) ∈ ({(1 : ℤ), (4 : ℤ), (1009 : ℤ), (4036 : ℤ), (1018081 : ℤ), (4072324 : ℤ)} : Set ℤ) := by norm_num

theorem putnam_2018_a1
  (a b : ℤ)
  (h : 0 < a ∧ 0 < b) :
  ((1 : ℚ) / a + (1 : ℚ) / b = (3 : ℚ) / 2018) ↔
    (⟨a, b⟩ ∈ putnam_2018_a1_solution) := by simp_all
